SwimmingPool/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБассейна</name>
    <type>
      <types>CatalogRef.ВидыБассейнов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SwimmingPool/src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПосещениеБассейна</name>
  </enumValues>
</mdclass:Enum>

SwimmingPool/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	Объект.Наименование = Объект.Наименование + " " + Объект.ВидБассейна + " " + Объект.КоличествоПосещений
КонецПроцедуры




#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостиЭлементовФормы();
КонецПроцедуры





#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	УправлениеВидимостиЭлементовФормы();
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>


#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостиЭлементовФормы()
	
	ЭтоПосещениеБассейна = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеБассейна);
	Элементы.ВидБассейна.Видимость = ЭтоПосещениеБассейна;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеБассейна;
	Если ЭтоПосещениеБассейна = Истина Тогда
		Объект.Наименование = Объект.Наименование + Объект.ВидБассейна + Объект.КоличествоПосещений
	КонецЕсли
	
КонецПроцедуры	

#КонецОбласти
